<template>
  <div class="container-fluid">
    <div class="p-4">
      <div
        style="
          font-size: 25px;
          font-weight: bold;
          margin: 0 0 30px 0;
          text-align: center;
        "
      >
        사용권 약관 (End User License Agreement)
      </div>
      <div>
        ㈜아티프렌즈는 제품 유형에 따1라 다음과 같은 사용권 약관을 제공하고
        있습니다. 제품 사용에 앞서 반드시 해당 사용권 약관을 확인하시기
        바랍니다.
      </div>
      <br />
      <div
        style="
          font-size: 20px;
          font-weight: bold;
          margin: 0 0 30px 0;
          text-align: center;
        "
      >
        최종 사용권 약관
      </div>
      <div>
        아래의 사용권 약관을 주의 깊게 확인하시기 바랍니다. 본 소프트웨어 사용권
        계약(이하 “본 계약”)은 ㈜아티프렌즈 소프트웨어 제품(이하 “SASEUL”)의
        사용 관련하여 귀하와 ㈜아티프렌즈 간에 체결되는 계약입니다. 귀하가 본
        계약에 동의하지 않는 경우 SASEUL을 설치, 복사하거나 사용하지 마십시오.
      </div>
      <br />
      <div class="title">1. 정의</div>
      <ul>
        <li class="text">
          1.1 본 계약에서 “SASEUL”이란 ㈜아티프렌즈가 개발 또는 생산하여 저작권,
          소유권 등의 권리를 보유한 SASEUL Engine 및 관련 SASEUL Module 등
          일체의 소프트웨어를 말합니다. SASEUL은 컴퓨터 소프트웨어, 기록매체,
          인쇄물 및 온라인 문서나 전자 문서를 비롯하여 이에 수반되는 모든
          실행파일, 추가 기능, 사용설명서, 도움말 파일, 기타 다른 파일 등을
          포함할 수 있습니다.
        </li>
        <li class="text">
          1.2 본 계약에서 “컴퓨터”란 서버 컴퓨터, 클라이언트 컴퓨터 등 통신망에
          연결되어 정보를 송수신 할 수 있는 정보처리장치를 말합니다.
        </li>
        <li class="text">
          1.3 본 계약에서 “사용”이란 SASEUL을 이용한 블록체인 모듈 생성,
          네트워크 구성, 네트워크 활용, 어플리케이션 제작 등 상업적 이용을 위한
          모든 행위를 말합니다.
        </li>
        <li class="text">
          1.4 본 계약에서 “Mainnet”이란 기존에 존재하는 플랫폼에 종속되어 있지
          않고, 독자적으로 구성한 블록체인 기반 네트워크를 말합니다.
        </li>
        <li class="text">
          1.5 본 계약에서 “Genesis”란 Mainnet을 런칭한 최초의 블록체인
          Node(서버) 또는 해당 Node의 소유자를 말합니다.
        </li>
        <li class="text">
          1.6 본 계약에서 “공급자”란 ㈜아티프렌즈의 총판, 리셀러 등 SASEUL
          판매에 관하여 ㈜아티프렌즈와 비즈니스 파트너 계약을 체결하였거나
          ㈜아티프렌즈로부터 공식 판매권한을 부여받은 자를 말합니다.
        </li>
        <li class="text">
          1.7 본 계약에서 “귀하” 내지 “고객”이란 ㈜아티프렌즈 또는 공급자와
          SASEUL 사용 허락에 관한 계약(이하 “구매계약”)을 체결한 단체 또는
          개인을 말합니다.
        </li>
        <li class="text">
          1.8 본 계약에서 “유료제품”이란 ㈜아티프렌즈 또는 공급자가 유상으로
          판매하는 SASEUL을 말합니다.
        </li>
        <li class="text">
          1.9 본 계약에서 “무료제품”이란 ㈜아티프렌즈 또는 공급자가 무상으로
          제공하는 SASEUL을 말합니다.
        </li>
      </ul>
      <br />
      <div class="title">2. 소프트웨어 사용 허락</div>
      <ul>
        <li class="text">
          2.1 제한적 사용권: ㈜아티프렌즈는 고객이 본 계약의 조건에 동의하는
          것을 전제로 사용기간(유료제품의 경우 구매계약에 따른 계약기간,
          무료제품의 경우 SASEUL을 사용하는 기간 동안 SAESUL에 관한 비독점적이고
          양도 불가능한 사용권을 부여합니다.
        </li>
        <li class="text">
          2.2 사용권 범위: 고객이 유료제품 구매자인 경우, ㈜아티프렌즈 또는
          공급자와 계약된 고객에게SASEUL License Key가 발급되며, 고객이 런칭한
          블록체인 Mainnet의 Genesis Network Address가 해당 License Key를 인증할
          수 있습니다. SASEUL은 네트워크 단위로 판매, 제공되며 1개의 License
          Key는 1개의 네트워크로 그 사용권 범위가 제한됩니다.
        </li>
        <li class="text">
          2.3 사용기간: 고객이 유료제품 구매자인 경우, 구매계약에 따른
          계약기간이 만료되는 경우 SASEUL을 사용할 수 없습니다. 고객은 사용간이
          만료되는 즉시 사용을 중지하여야 하며 SASEUL과 SASEUL을 이용해 만든
          Mainnet을 즉시 폐기하여야 합니다.
        </li>
        <li class="text">
          2.4 사용버전: 고객이 구 버전을 업그레이드하여 SASEUL을 사용하는 경우,
          고객은 구 버전을 별도로 양도, 대여 또는 판매할 수 없으며, 업그레이드된
          SASEUL에 포함되어 있지 않은 프로그램이나 부속된 파일이 구 버전에 있는
          경우에는 그 제외된 프로그램 및 부속 파일에 대해 사용권을 계속
          유지합니다. 구 버전을 사용하고 있던 고객이 신제품을 구매하여 SASEUL을
          사용하는 경우에도 고객은 그 구 버전을 별도로 양도, 대여 또는 판매할 수
          없으며, 신제품인 SASEUL에 포함되어 있지 않은 프로그램이나 부속된
          파일이 구 버전에 있는 경우에는 그 제외된 프로그램 및 부속 파일에 대해
          사용권을 계속 유지합니다.
        </li>
      </ul>
      <br />
      <div class="title">3. 소프트웨어 사용 제한</div>

      <ul>
        <li class="text">
          3.1 사용용도: 고객이 SASEUL의 Lite 버전을 이용하는 경우 이를 상업적
          사용목적으로 설치, 복사하거나 사용할 수 없습니다.
        </li>
        <li class="text">
          3.2 양도 등 금지: 고객은 ㈜아티프렌즈의 사전 서면 동의 없이는 SASEUL의
          이용 권한이나 SASEUL 사용권 취득과 관련한 계약상 지위를 타인에게
          양도하거나 담보로 제공할 수 없습니다. 예외적으로 고객이 SASEUL에 관한
          권리를 타인에게 양도하거나 담보로 제공하는 경우, 고객은 SASEUL의
          복사본을 소지할 수 없고, 본 계약서, License Key, 기록매체, 인쇄물,
          매뉴얼, 업그레이드 버전 등을 포함하여 SASUEL과 관련한 모든 자료를
          양수인에게 교부하여야 하며, 양수인은 본 계약의 모든 조건에 동의해야
          합니다. 고객은 어떠한 경우에도 본 계약의 체결로 취득한 고객의 권리 중
          일부를 분리하여 양도할 수 없습니다. 본 양도 제한 조항을 위반하여
          발생하는 모든 책임은 고객에게 있으며 ㈜아티프렌즈는 이에 대하여 아무런
          책임을 지지 않습니다.
        </li>
      </ul>
      <br />
      <div class="title">4. 인터넷 기반 서비스 제공</div>
      <ul>
        <li class="text">
          4.1 인터넷 연결: SASEUL이 정상 작동하기 위하여 안정적으로 인터넷에
          연결되어 있을 필요가 있습니다. 언제든지 안정적인 인터넷 연결이
          가능하도록 유지할 책임은 고객에게 있습니다.
        </li>
        <li class="text">
          4.2 업그레이드: ㈜아티프렌즈는 SASEUL의 업그레이드버전 또는 신제품을
          출시했을 경우 그 내용을 고객에게 알릴 의무가 있으며, 합리적으로 필요한
          특정기간 동안 구 버전에 대한 판매 및 패치파일의 제공 등을 포함한 모든
          고객지원 서비스를 제공할 수 있습니다. ㈜아티프렌즈의 고객에 대한
          통보는 홈페이지에서의 공지, 고객에 대한 메일 발송 등의 방법을 통하여
          이루어질 수 있습니다.
        </li>
        <li class="text">
          4.3 정보수집: ㈜아티프렌즈는 SASEUL의 품질 및 성능 개선을 위하여
          고객의 SASEUL 사용 과정에서 발견된 다음 각호의 정보를 수집할 수
          있습니다. ㈜아티프렌즈는 개인정보보보호법 등 관련 법규를 준수하며,
          수집한 정보를 외부에 전달하거나 공개하지 않습니다.
          <ol type="a" style="margin: 5px 0; padding: 10px 30px">
            <li class="sub">고객의 컴퓨터의 하드웨어 및 소프트웨어 정보</li>
            <li class="sub">
              시스템 파일의 조작이나 중요 프로세스에 접근하는 것과 같은 잠재적
              보안 위협이 될 수 있는 프로그램의 행위 정보 및 그 행위를 수행한
              것으로 판단되는 프로세스와 응용프로그램의 정보
            </li>
            <li class="sub">
              잠재적인 보안 위협에 대한 응답으로 보내진 데이터 샘플 정보
            </li>
            <li class="sub">
              웹 브라우저 등을 통해 다운로드 된 응용프로그램에 대한 정보
            </li>
            <li class="sub">악성코드에 대한 진단 정보</li>
          </ol>
        </li>
        <li class="text">
          4.4 기타: ㈜아티프렌즈는 SASEUL에 대한 지원 및 품질 개선을 위하여
          고객이 사용하고 있는 제품의 버전, 에러정보 등 개인을 식별할 수 없는
          비개인정보를 수집할 수 있습니다.
        </li>
      </ul>
      <br />
      <div class="title">5. 지식재산권</div>
      <ul>
        <li class="text">
          5.1 지식재산권자: SASEUL은 저작권법, 기타 지식재산권 관련 법률 및
          저작권에 관한 국제협약에 의해 보호됩니다. 고객에게는 SASEUL에 대한 비
          배타적인 사용이 허가될 뿐 SASEUL에 대한 특허권, 저작권, 기타 일체의
          지식재산권(이하 “지식재산권 등”)은 ㈜아티프렌즈에게 있습니다. 따라서
          SASEUL의 설치ㆍ사용 등으로 인하여 SASEUL에 대한 지적재산권 등이
          고객에게 이전되는 것은 아니며, 본 계약에 따른 사용권 허가는 SASEUL에
          대한 지적재산권 등의 이전 또는 판매로 해석되지 않습니다. SASEUL에 관한
          모든 권리는 ㈜아티프렌즈에게 있습니다.
        </li>
        <li class="text">
          5.2 침해금지: 고객은 원칙적으로 SASEUL에 대한 ㈜아티프렌즈의
          지적재산권 등을 침해하는 행위를 할 수 없으며, SASEUL을 사용해 2차
          저작물을 만들 수 없습니다. 고객은 SASEUL의 지적재산권의 귀속에 관한
          표시, 마크, 라벨 등 권리 관련 정보를 제거할 수 없습니다. 고객은 본
          계약에서 명시적으로 허용된 경우를 제외하고 SASEUL을 리버스엔지니어링,
          디컴파일 또는 디스어셈블할 수 없으며, ㈜아티프렌즈의 사전 서면 동의
          없이 SASEUL의 전부 또는 일부에 대해 번역, 재배포, 재전송, 출판, 판매,
          대여, 임대, 매매, 전매, 질권설정, 담보설정, 이전, 변경, 수정 또는 확장
          등을 할 수 없습니다. 본 계약에 위배되는 SASEUL의 복제나 재 배포는
          저작권 침해행위에 해당할 수 있으며, 민ㆍ형사상 책임을 부담할 수
          있습니다.
        </li>
      </ul>
      <br />
      <div class="title">6. 오픈소스 소프트웨어</div>
      <ul>
        <li class="text">
          6.1 오픈소스 소프트웨어 사용: SASEUL에는 오픈소스 소프트웨어를 이용한
          소프트웨어 내지 라이브러리가 포함되어 있을 수 있습니다. 이 경우
          오픈소스 소프트웨어에 대한 라이선스는 고유의 적용 가능한 라이선스
          조건에 따라 고객에게 부여됩니다.
        </li>
        <li class="text">
          6.2 오픈소스 소프트웨어 라이선스 조건: 오픈소스 소프트웨어의 개별
          라이선스 조건 및 관련 문서, 기타 자료, 저작권 표시 등 세부사항은
          SASEUL에서 제공되는 문서 또는 ㈜아티프렌즈 오픈소스 사이트에서 확인할
          수 있으며, 이는 해당 라이선스 허가권자에 의해 별도의 고지나 통지 없이
          변경될 수 있습니다. 오픈소스 소프트웨어의 라이선스 조건과 본 계약의
          내용이 상충하는 경우, 그 범위에 한하여 오픈소스 소프트웨어의 라이선스
          조건이 우선됩니다. 고객은 오픈소스 소프트웨어의 라이선스 조건에 따라
          ㈜아티프렌즈 오픈소스 사이트를 통해 오픈소스 파일의 사본을 수령할 수
          있습니다. (사정에 따라 웹사이트에 게시되지 못한 오픈소스 파일의 사본은
          본 계약서에 기재된 연락처를 통해 수령할 수 있습니다.)
        </li>
        <li class="text">
          6.3 오픈소스 소프트웨어 관련 보증의 배제: 오픈소스 소프트웨어는 유용한
          사용을 위해 배포되고 있지만 특정한 목적에의 적합성 여부나 판매용으로
          사용할 수 있다는 묵시적인 보증을 포함한 어떠한 형태의 보증도 제공하지
          않습니다. 오픈소스 소프트웨어의 라이선스 허가권자, ㈜아티프렌즈,
          공급자 등은 고객의 오픈소스 소프트웨어 사용으로 인하여 발생하는 일체의
          손해에 대해, 그 손해 발생 가능성을 사전에 알고 있었다 하더라도, 관련
          법률이 허용하는 최대한의 범위 내에서 어떠한 책임도 부담하지 않습니다.
        </li>
      </ul>
      <br />
      <div class="title">7. 제한적 보증: 면책조항 및 책임의 배제</div>
      <ul>
        <li class="text">
          7.1 보증의 배제: SASEUL의 사용 및 성능과 고객지원 서비스에 따른 모든
          위험(고객의 불성실한 엔진 업데이트로 인한 경우 포함)은 고객이
          부담합니다. ㈜아티프렌즈 및(또는) 공급자는 관련 법률이 허용하는
          최대한의 범위 내에서 상품성, 특정 목적에 대한 적합성, 지식재산권 또는
          지식재산권의 비침해성에 대한 묵시적 보증 등을 포함한 명시적 또는
          묵시적인 모든 보증을 배제합니다. ㈜아티프렌즈는 SASEUL에 포함된 기능이
          고객의 요구사항을 충족시키거나 SASEUL의 사용시 컴퓨터의 사용에
          일시적인 간섭이나 오류가 발생하지 않을 것을 보증하지 않으며, 기타 관련
          법률이 허용하는 범위에서 배제 가능한 모든 보증을 배제합니다.
          ㈜아티프렌즈는 SASEUL의 판매 이후에 제조된 컴퓨터 하드웨어와 컴퓨터
          운영체제의 변경에 따라서 발생하는 문제에 대해 책임지지 않습니다. 또한
          SASEUL이 출시된 이후 발견된 신종 바이러스 또는 유해 가능 프로그램
          등으로 인하여 고객이 피해를 입거나 SASEUL의 업그레이드버전 또는
          신제품이 출시되어 구 버전에 대한 고객 지원 서비스가 중단된 이후에
          발견된 신종 바이러스 또는 유해가능 프로그램 등으로 인하여 고객이
          피해를 입는 경우에 ㈜아티프렌즈는 그에 대한 피해도 책임지지 않습니다.
        </li>
        <li class="text">
          7.2 구제방법: SASEUL과 관련하여 ㈜아티프렌즈가 부담할 모든 책임과
          고객이 ㈜아티프렌즈로부터 받을 수 있는 유일한 구제 방법은
          ㈜아티프렌즈의 재량에 따라 (i) 결함 있는 SASEUL의 교체, (ii)
          ㈜아티프렌즈의 제한적 보증을 충족시키지 못하는 SASEUL의 수정 또는
          보수, (iii) 본 계약의 해지와 구입비의 환불(고객이 구입비를 지급한
          경우) 중 1가지로 한정됩니다. 고객은 보증기간 내에 구입증서를
          ㈜아티프렌즈에 발송함으로써 위와 같은 구제 조치를 받을 수 있습니다.
        </li>
        <li class="text">
          7.3 책임제한: 본 계약에 규정된 구제 조치가 그 목적을 달성했는지 여부를
          불문하고, ㈜아티프렌즈 및(또는) 공급자는 본 계약에서 명시된 것을
          제외하고는 관련 법률이 허용하는 최대한의 범위 내에서 SASEUL의 사용,
          사용불능 또는 고객지원 서비스의 제공이나 그 불이행으로 야기된 모든
          손해(결과적, 우연적, 간접적, 특별, 경제적, 징벌적 또는 기타 이와
          유사한 모든 손해 또는 사업상 이익의 손실, 영업권의 손실, 사업에 대한
          간섭, 컴퓨터의 기능 마비 또는 오동작, 사업 정보의 손실 또는 기타 제반
          상업적 또는 금전적 손해 또는 손실 등을 포함)에 대해 책임을 지지
          않습니다.
        </li>
      </ul>
      <br />
      <div class="title">8. 계약의 종료</div>
      <ul>
        <li class="text">
          8.1 해지: 고객은 언제든지 SASEUL을 영구히 폐기함으로써 본 계약을
          해지할 수 있습니다. SASEUL을 무단으로 복사하거나 복제하면, 본 계약은
          자동으로 해지됩니다. 본 계약이 해지되는 경우 고객은 SASEUL 및 고객이
          만든 모든 복사본을 영구히 폐기해야 합니다. 고객의 귀책사유에 의하여 본
          계약이 해지되는 경우, 고객이 SASEUL에 대한 사용권을 취득하기 위해
          지불한 사용권료 등은 반환되지 않습니다.
        </li>
      </ul>
      <br />
      <div class="title">9. 일반사항</div>
      <ul>
        <li class="text">
          9.1 완전합의: 본 계약은 고객과 ㈜아티프렌즈 간의 전체 계약을 규정하며,
          본 계약의 주요 사항에 대해 본 계약 이전에 작성된 서면 또는 구두의 모든
          계약, 양해 및 진술, 광고, 고지 등을 대체합니다.
        </li>
        <li class="text">
          9.2 계약내용 변경: ㈜아티프렌즈는 관계 법규 개정이나 소프트웨어의 변경
          등으로 필요한 경우 언제든지 본 계약을 수정할 수 있습니다. 이 경우,
          웹사이트에 게시된 ㈜아티프렌즈 소프트웨어 사용권 계약을 업데이트하는
          동시에 고객이 제공한 연락처 정보 등을 통해 업데이트된 계약을 고객에게
          통지하여, 아래 기재된 기간 내에 업데이트된 계약을 검토한 후 수락하거나
          거부할 기회가 제공됩니다.
          <ul style="margin: 5px 0; padding: 10px 30px">
            <li class="sub">
              고객이 유료제품 구매자인 경우, 기존 구매계약을 연장하거나 갱신하면
              본 계약의 변경사항이 수락되어 업데이트된 계약이 갱신 시점부터
              적용됩니다. 개정된 계약에 동의하지 않는 경우, 계약기간 말에 갱신을
              해제하고 SASEUL을 제거하며 모든 서비스 사용을 중지함으로써
              변경사항을 거부해야 합니다.
            </li>
            <li class="sub">
              고객이 무료제품 구매자인 경우, 본 항에서 명시된 통지 이후에
              SASEUL을 계속하여 사용하면 계약의 변경사항을 수락하는 것으로
              간주됩니다. 업데이트된 계약에 동의하지 않는 경우 SASEUL에 대한
              모든 액세스 및 사용을 중단하고 이를 제거하여야 합니다.
            </li>
          </ul>
        </li>
        <li class="text">
          9.3 일부무효: 본 계약 중 일부 조항이 무효이거나 시행할 수 없는
          경우라도 본 계약의 나머지 조항의 유효성에는 아무런 영향을 미치지
          아니합니다.
        </li>
        <li class="text">
          9.4 언어: 본 계약은 본래 국문으로 작성되었습니다. ㈜아티프렌즈는
          고객의 편의를 위해 본 계약에 대해 1개 이상의 번역본을 제공할 수
          있지만, 내용의 충돌 또는 불일치가 있는 경우 국문이 우선합니다.
        </li>
        <li class="text">
          9.5 준거법 및 관할: ㈜아티프렌즈와 고객 사이에 발생한 SASEUL 이용에
          관한 분쟁에 대하여는 대한민국 법률이 적용되며, 분쟁이 ㈜아티프렌즈와
          고객의 협의에 의하여 원만히 해결되지 않는 경우 대한민국의
          서울중앙지방법원을 전속적 1심 관할법원으로 하여 해결합니다.
        </li>
        <li class="text">
          9.6 연락처: 본 계약 관련하여 의문사항이 있거나 요청이 필요한 경우,
          해당하는 연락처로 연락하여 주십시오.
        </li>
      </ul>
      <div class="info">대한민국: 팩스(031-712-8133)</div>
      <div class="info">전자메일(help@artifriends.com)</div>
      <div class="info">
        주소(경기도 성남시 분당구 정자일로 248, 파크뷰오피스상가동 1908호
        우편번호 13554)
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "LicensePolicy",
};
</script>

<style scoped>
.info {
  text-align: right;
  margin: 5px 0 0 0;
  font-weight: bold;
  font-size: 15px;
}
.sub {
  font-size: 13px;
}
.title {
  margin: 0 0 10px 0;
  font-size: 17px;
  font-weight: bold;
}
.text {
  margin: 0 0 10px 0;
}
</style>
